In [1]:
import pandas as pd

In [2]:
import pandas as pd
dict1={'Name':['Aditya','Naina','Subhashree','Binit','Subhasis',
               'Satyam','Harsha'],
                'Marks':[89,89,78,98,56,90,80],
                 'Gender':['Male','Female','Female','Male','Male',
                          'Male','Female']}
df1=pd.DataFrame(dict1)
df1

         Name  Marks  Gender
0      Aditya     89    Male
1       Naina     89  Female
2  Subhashree     78  Female
3       Binit     98    Male
4    Subhasis     56    Male
5      Satyam     90    Male
6      Harsha     80  Female

Display top 3 rows of the data set

In [3]:
df1.head(3)

         Name  Marks  Gender
0      Aditya     89    Male
1       Naina     89  Female
2  Subhashree     78  Female

check last 3 rows of the dataset

In [4]:
df1.tail(3)

       Name  Marks  Gender
4  Subhasis     56    Male
5    Satyam     90    Male
6    Harsha     80  Female

find the no of rows and no of columns of the dataset

In [6]:
df1.shape

(7, 3)

In [8]:
print('no of rows',df1.shape[0])
print('no of columns',df1.shape[1])

no of rows 7
no of columns 3

Get information of the dataset

In [9]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

check null values of the dataset

In [10]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [11]:
#displaying sum of null values column wise
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [12]:
#displaying sum of null values column wise
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [15]:
#displaying sum of nullvalues row wise
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

get overall statistics about dataframes

In [16]:
df1.describe()

           Marks
count   7.000000
mean   82.857143
std    13.594467
min    56.000000
25%    79.000000
50%    89.000000
75%    89.500000
max    98.000000

In [17]:
df1.describe(include='all')

          Name      Marks Gender
count        7   7.000000      7
unique       7        NaN      2
top     Aditya        NaN   Male
freq         1        NaN      4
mean       NaN  82.857143    NaN
std        NaN  13.594467    NaN
min        NaN  56.000000    NaN
25%        NaN  79.000000    NaN
50%        NaN  89.000000    NaN
75%        NaN  89.500000    NaN
max        NaN  98.000000    NaN

find unique values from the gender column

In [19]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

find the number of unique values from the gender column

In [22]:
df1['Gender'].nunique()

2

display count of unique values in gender column

In [23]:
df1['Gender'].value_counts()

Male      4
Female    3
Name: Gender, dtype: int64

Find the total no of student having marks between 90 to 100(inclusive)

In [26]:
df1['Marks']>=90

0    False
1    False
2    False
3     True
4    False
5     True
6    False
Name: Marks, dtype: bool

In [27]:
df1[df1['Marks']>=90]

     Name  Marks Gender
3   Binit     98   Male
5  Satyam     90   Male

In [31]:
#without using between method
len(df1[(df1['Marks']>=90 ) & (df1['Marks']<=100)])

2

In [34]:
#with using between method
sum(df1['Marks'].between(90,100))

2

Find the average marks

In [35]:
df1['Marks'].mean()

82.85714285714286

In [37]:
print(df1['Marks'].min())
print(df1['Marks'].max())

56
98

Apply method

In [38]:
def marks(x):
    return x/2
df1['Marks'].apply(marks)

0    44.5
1    44.5
2    39.0
3    49.0
4    28.0
5    45.0
6    40.0
Name: Marks, dtype: float64

In [39]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [40]:
df1

         Name  Marks  Gender  Half_marks
0      Aditya     89    Male        44.5
1       Naina     89  Female        44.5
2  Subhashree     78  Female        39.0
3       Binit     98    Male        49.0
4    Subhasis     56    Male        28.0
5      Satyam     90    Male        45.0
6      Harsha     80  Female        40.0

In [44]:
df1['Marks'].apply(lambda x:x/2)

0    44.5
1    44.5
2    39.0
3    49.0
4    28.0
5    45.0
6    40.0
Name: Marks, dtype: float64

In [45]:
df1['Name'].apply(len)

0     6
1     5
2    10
3     5
4     8
5     6
6     6
Name: Name, dtype: int64

Map function

In [46]:
df1['Gender'].map({'Male':1,'Female':0})

0    1
1    0
2    0
3    1
4    1
5    1
6    0
Name: Gender, dtype: int64

In [47]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [48]:
df1

         Name  Marks  Gender  Half_marks  Male_Female
0      Aditya     89    Male        44.5            1
1       Naina     89  Female        44.5            0
2  Subhashree     78  Female        39.0            0
3       Binit     98    Male        49.0            1
4    Subhasis     56    Male        28.0            1
5      Satyam     90    Male        45.0            1
6      Harsha     80  Female        40.0            0

drop the column

In [50]:
df1.drop(['Male_Female','Half_marks'],axis=1)

         Name  Marks  Gender
0      Aditya     89    Male
1       Naina     89  Female
2  Subhashree     78  Female
3       Binit     98    Male
4    Subhasis     56    Male
5      Satyam     90    Male
6      Harsha     80  Female

print name of the columns

In [51]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half_marks', 'Male_Female'], dtype='object')

In [52]:
df1.index

RangeIndex(start=0, stop=7, step=1)

sort thr dataset as per the marks columnn

In [55]:
df1.sort_values(by='Marks')

         Name  Marks  Gender  Half_marks  Male_Female
4    Subhasis     56    Male        28.0            1
2  Subhashree     78  Female        39.0            0
6      Harsha     80  Female        40.0            0
0      Aditya     89    Male        44.5            1
1       Naina     89  Female        44.5            0
5      Satyam     90    Male        45.0            1
3       Binit     98    Male        49.0            1

In [56]:
df1.sort_values(by='Marks',ascending=False)

         Name  Marks  Gender  Half_marks  Male_Female
3       Binit     98    Male        49.0            1
5      Satyam     90    Male        45.0            1
0      Aditya     89    Male        44.5            1
1       Naina     89  Female        44.5            0
6      Harsha     80  Female        40.0            0
2  Subhashree     78  Female        39.0            0
4    Subhasis     56    Male        28.0            1

In [57]:
df1.sort_values(by=['Marks','Gender'],ascending=False)

         Name  Marks  Gender  Half_marks  Male_Female
3       Binit     98    Male        49.0            1
5      Satyam     90    Male        45.0            1
0      Aditya     89    Male        44.5            1
1       Naina     89  Female        44.5            0
6      Harsha     80  Female        40.0            0
2  Subhashree     78  Female        39.0            0
4    Subhasis     56    Male        28.0            1

display name and marks of female student only

In [59]:
df1[df1["Gender"]=='Female'][['Name','Marks']]

         Name  Marks
1       Naina     89
2  Subhashree     78
6      Harsha     80

In [61]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

         Name  Marks
1       Naina     89
2  Subhashree     78
6      Harsha     80